    05  ACCT-ID            PIC X(12).
    05  CUST-ID            PIC X(12).
    05  PRODUCT            PIC X(4).
    05  ACCT-STATUS        PIC X(1).
    05  CURR-BAL           PIC S9(11)V99 COMP-3.
    05  OVERDRAFT-LIMIT    PIC S9(9)V99  COMP-3.
    05  OPEN-DATE          PIC 9(8).
    05  CLOSE-DATE         PIC 9(8).
    05  TXN-COUNT          PIC 9(4) COMP-5.
    05  LAST-INTEREST      PIC S9(9)V99 COMP-3.
